#include <iostream>

/*
 * Написать функцию, которая принимаем указатель на char, по которому лежит строка.
 * Функция должна возвращать true, если вторая строка является подстрокой первой.
 * Пример:
 * char* a = “Hello world”;
 * char* b = “wor”;
 * char* c = “banana”;
 * std::cout << substr(a,b) << “ “ << substr(a,c);
 * // true false
 */

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
